In [ ]:
#Data.csv

**Step 1: Importing the libraries**

In [1]:
import pandas as pd

**Step 2: Importing dataset**

In [5]:
df=pd.read_csv("./Data.csv")
print(df.shape)
df.head(4)

(10, 4)

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No

**Step 3: Handling the missing data**

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Country    10 non-null     object
 1   Age        9 non-null      float64
 2   Salary     9 non-null      float64
 3   Purchased  10 non-null     object
dtypes: float64(2), object(2)
memory usage: 448.0+ bytes

In [4]:
df.isna().sum()

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

In [15]:
df.loc[df["Age"].isna(),"Age"]=df.Age.mean()

In [19]:
df["Age"].isna().sum()

0

In [23]:
df.loc[df["Salary"].isna(),"Salary"]=df.Salary.mean()

In [24]:
df.isna().sum()

Country      0
Age          0
Salary       0
Purchased    0
dtype: int64

**Step 4: Encoding categorical data**

In [41]:
df["Purchased"]=df["Purchased"].replace(["Yes","No"],[1,0])

**Step 5: Creating a dummy variable**

In [26]:
df["Country"].unique()

array(['France', 'Spain', 'Germany'], dtype=object)

In [38]:
df=pd.get_dummies(data=df,columns=["Country"],drop_first=True)

**Step 6: Splitting the datasets into training sets and Test sets**

In [42]:
from sklearn.model_selection import train_test_split

In [43]:
x=df.drop("Purchased",axis=1)
y=df["Purchased"]

In [44]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=.30,random_state=55)

In [46]:
len(x_train),len(x_test)

(7, 3)

**Step 7: Feature Scaling**

In [45]:
x.head(4)

    Age   Salary  Country_Germany  Country_Spain
0  44.0  72000.0                0              0
1  27.0  48000.0                0              1
2  30.0  54000.0                1              0
3  38.0  61000.0                0              1

In [47]:
from sklearn.preprocessing import MinMaxScaler
minmax=MinMaxScaler()
minmax.fit(x_train)

x_train_scaled=minmax.transform(x_train)
x_test_scaled=minmax.fit_transform(x_test)

In [49]:
x_test_scaled

array([[0.71428571, 0.54320988, 1.        , 0.        ],
       [1.        , 1.        , 0.        , 0.        ],
       [0.        , 0.        , 1.        , 0.        ]])